tap "ariga/tap"
tap "bufbuild/buf"
tap "cloudflare/cloudflare"
tap "heroku/brew"
tap "homebrew/services"
tap "leoafarias/fvm"
tap "mobile-dev-inc/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "revylai/tap"
tap "shivammathur/php"
tap "stripe/stripe-cli"
tap "supabase/tap"
tap "watari995/tap", "https://github.com/Watari995/homebrew-tap"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Easiest way to build and release mobile apps
brew "fastlane"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Database migrations CLI tool
brew "golang-migrate"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# LLM inference in C/C++
brew "llama.cpp"
# Package manager for the Lua programming language
brew "luarocks"
# Selects the right Node package manager based on lockfiles
brew "ni"
# Development kit for the Java programming language
brew "openjdk@17"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Fast, recursive file searcher
brew "ripgrep"
# Non-interactive SSH password auth
brew "sshpass"
# Version control system designed to be a better CVS
brew "subversion"
# Postgres development platform
brew "supabase"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# JavaScript package manager
brew "yarn"
# Browse and preview images pasted into Claude Code sessions
brew "watari995/tap/cc-preview", trusted: true
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Developer platform
cask "dotnet-sdk"
cask "font-blex-mono-nerd-font"
cask "font-hackgen-nerd"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Desktop automation application
cask "hammerspoon"
# AI agent command center
cask "maestro"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emeraldwalk.runonsave"
vscode "enkia.tokyo-night"
vscode "equimper.react-native-react-redux"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "jackiotyu.git-worktree-manager"
vscode "khan.two-monokai"
vscode "localizely.flutter-intl"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "shardulm94.trailing-spaces"
vscode "simonsiefke.svg-preview"
vscode "skyran.js-jsx-snippets"
vscode "streetsidesoftware.code-spell-checker"
vscode "tompollak.lazygit-vscode"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "zarifprogrammer.tailwind-snippets"
vscode "zhang-renyang.vscode-react"
vscode "zxh404.vscode-proto3"
cargo "tauri-cli"
cargo "tree-sitter-cli"
npm "@anthropic-ai/claude-code"
npm "@openai/codex"
npm "corepack"
npm "cspell"
